const COMPLAINT_PARTS = ['Рама', 'Створка', 'Импост', 'Заполнение', 'Фурнитура', 'Комплектующие', 'Доставка']

const REASONS_BY_PART = {
  Рама: ['Лопина/скол', 'Царапина'],
  Створка: ['Лопина/скол', 'Царапина'],
  Импост: ['Лопина/скол', 'Царапина', 'Щель'],
  Фурнитура: ['Недовоз', 'Некомплект', 'Поломка'],
  Заполнение: [
    'Бой/скол/лопина',
    'Царапины/пузыри',
    'Недовоз',
    'Разгерметизация/Запотевание',
    'Мусор/Герметик/Разводы',
    'Раскладка/Фальш',
    'Не соответствует формула',
  ],
  Комплектующие: ['Недовоз', 'Некомплект', 'Брак материала'],
  Доставка: ['Опоздание', 'Персонал'],
}

const ALLOWED_YEARS = ['2026', '2025', '2024', '2023', '2022']

module.exports = {
  COMPLAINT_PARTS,
  REASONS_BY_PART,
  ALLOWED_YEARS,
}
